<a name='0'></a>
# Data Manipulation with Pandas

 In this lab, you will learn how to manipulate data with Pandas. Here is an overview:

* [1. Basics of Pandas for data manipulation:](#1)

     * [A. Series and DataFrames](#1-1)
     * [B. Data Indexing and Selection, and Iteration](#1-2)
     * [C. Dealing with Missing data](#1-3)
     * [D. Basic operations and Functions](#1-4)
     * [E. Aggregation Methods](#1-5)
     * [F. Groupby](#1-6)
     * [G. Merging, Joining and Concatenate](#1-7)
     * [H. Beyond Dataframes: Working with CSV, and Excel](#1-8)
     
* [2. Real World Exploratory Data Analysis (EDA)](#2)

<a name='1'></a>
## 1. Basics of Pandas for data manipulation

<a name='1-1'></a>
### A. Series and DataFrames

Both series and DataFrames are Pandas Data structures. 

Series is like one dimensional NumPy array with axis labels.

DataFrame is multidimensional NumPy array with labels on rows and columns. 

Working with NumPy, we saw that it supports numeric type data. Pandas on other hand supports whole range of data types, from numeric to strings, etc..

In [ ]:
# notes:
'''
series: list pada pandas
dataframe: table pada pandas (entity)
'''

Since we are using python notebook, we do not need to install Pandas. We only just have to import it. 

```
import pandas as pd
```

In [2]:
pip install numpy

Requirement already satisfied: numpy in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (1.22.3)Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Users\user\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (1.5.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2022.4)
Requirement already satisfied: numpy>=1.21.0 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.22.3)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Users\user\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [1]:
# importing numpy and pandas

import numpy as np
import pandas as pd

In [7]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

#### Creating Series

Series can be created from a Python list, dictionary, and NumPy array.

In [8]:
# Creating the series from a Python list

num_list = [1,2,3,4,5]

s1 = pd.Series(num_list)

In [11]:
# mengakses
s1[2]

3

In [12]:
s1[2:]

2    3
3    4
4    5
dtype: int64

In [13]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
week_days = ['Mon','Tues','Wed','Thur','Fri']

wd = pd.Series(week_days, index=["a", "b", "c", "d", "e"])

In [21]:
# mereturn value saja
wd['a']

'Mon'

In [19]:
# mereturn value saja
wd[0]

'Mon'

In [20]:
# indexing, mengakses index yang bukan integer, mereturn series
wd[wd.index == 'a']

a    Mon
dtype: object

In [22]:
wd[wd.index != 'a']

b    Tues
c     Wed
d    Thur
e     Fri
dtype: object

Note the data types `int64` and `object`.

In [23]:
# Creating the Series from dictionary 

countries_code = { 1:"United States",
                 91:"India",
                 49:"Germany",
                 86:"China",
                250:"Rwanda"}

pd.Series(countries_code)

1      United States
91             India
49           Germany
86             China
250           Rwanda
dtype: object

In [24]:
cc = pd.Series(countries_code)

In [25]:
cc

1      United States
91             India
49           Germany
86             China
250           Rwanda
dtype: object

In [26]:
cc.index

Int64Index([1, 91, 49, 86, 250], dtype='int64')

In [27]:
cc.values

array(['United States', 'India', 'Germany', 'China', 'Rwanda'],
      dtype=object)

In [28]:
d = {1:'a', 2:'b', 3:'c', 4:'d'}
pd.Series(d)

1    a
2    b
3    c
4    d
dtype: object

In [32]:
l1 = [1,2,3,4,5]
arr = np.array(l1)

In [30]:
l1

[1, 2, 3, 4, 5]

In [33]:
arr

array([1, 2, 3, 4, 5])

In [34]:
# Creating the Series from NumPy array
# We peovide the list of indexes
# if we don't provide the indexes, the default indexes are numbers...starts from 0,1,2..

# arr = np.array ([1, 2, 3, 4, 5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [35]:
pd.Series(arr, index=['a', 'b', 'c', 'd', 'e'])

a    1
b    2
c    3
d    4
e    5
dtype: int32

#### Creating DataFrames

DataFrames are the most used Pandas data structure. It can be created from a dictionary, 2D array, and Series.

In [43]:
# Creating a dataframe

products = {'product_name':['laptop', 'printer','tablet','desk','chair'],
            'price':[1200,150,300,450,200],
            'quantity':[100,20,300,55,110],
            'weight':[0.5,np.nan,0.2,2.4,np.nan]}

df = pd.DataFrame(products)
df.index = ([1, 2, 3, 4, 5])

df

  product_name  price  quantity  weight
1       laptop   1200       100     0.5
2      printer    150        20     NaN
3       tablet    300       300     0.2
4         desk    450        55     2.4
5        chair    200       110     NaN

In [44]:
df.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [45]:
df.columns

Index(['product_name', 'price', 'quantity', 'weight'], dtype='object')

In [46]:
df.dtypes

product_name     object
price             int64
quantity          int64
weight          float64
dtype: object

In [47]:
df.isna().sum()

product_name    0
price           0
quantity        0
weight          2
dtype: int64

In [48]:
df.shape

(5, 4)

In [49]:
df.size

20

In [50]:
df.dropna(axis=0)

  product_name  price  quantity  weight
1       laptop   1200       100     0.5
3       tablet    300       300     0.2
4         desk    450        55     2.4

In [51]:
df.dropna(axis=1)

  product_name  price  quantity
1       laptop   1200       100
2      printer    150        20
3       tablet    300       300
4         desk    450        55
5        chair    200       110

In [54]:
df['revenue'] = (df['price'].values * df['quantity'].values)
df

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
2      printer    150        20     NaN     3000
3       tablet    300       300     0.2    90000
4         desk    450        55     2.4    24750
5        chair    200       110     NaN    22000

In [57]:
df[df['revenue'] > 10000]

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
3       tablet    300       300     0.2    90000
4         desk    450        55     2.4    24750
5        chair    200       110     NaN    22000

In [66]:
df

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
2      printer    150        20     NaN     3000
3       tablet    300       300     0.2    90000
4         desk    450        55     2.4    24750
5        chair    200       110     NaN    22000

In [107]:
# df[df.quantity == df.quantity.max()]

df.loc[df['quantity'] == df['quantity'].max(), 'product_name'].item()

'tablet'

In [108]:
df[df['quantity']==df['quantity'].max()]['product_name'].values[0]

'tablet'

In [103]:
df[df['quantity']==df['quantity'].max()] ['product_name']

3    tablet
Name: product_name, dtype: object

In [89]:
# df[df.price == df.price.max()]
df[df.price == df.price.max()] [['product_name','price']]

  product_name  price
1       laptop   1200

In [77]:
df[df['weight'] < 1]

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
3       tablet    300       300     0.2    90000

In [39]:
# Creating DataFrame from a dictionary

countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

cdf = pd.DataFrame(countries)

In [40]:
cdf

     Name  Codes
0     USA      1
1   India     91
2  German     49
3  Rwanda    250

In [41]:
cdf.index

RangeIndex(start=0, stop=4, step=1)

In [42]:
cdf.values

array([['USA', 1],
       ['India', 91],
       ['German', 49],
       ['Rwanda', 250]], dtype=object)

In [43]:
cdf.columns

Index(['Name', 'Codes'], dtype='object')

In [44]:
cdf.Name.values

array(['USA', 'India', 'German', 'Rwanda'], dtype=object)

In [45]:
cdf.Codes.values

array([  1,  91,  49, 250], dtype=int64)

In [46]:
# Creating a dataframe from a 2D array
# You pass the list of columns

array_2d = np.array ([[1,2,3], [4,5,6], [7,8,9]])

pd.DataFrame(array_2d, columns = ['column 1', 'column 2', 'column 3'])

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [47]:
# list of tupple
ex1 = [('a','b',3),('c','d',6)]
pd.DataFrame(ex1)

   0  1  2
0  a  b  3
1  c  d  6

In [ ]:
df1.columns

In [48]:
# Creating a dataframe from Pandas series 
# Pass the columns in a list

countries_code = { "United States": 1,
                 "India": 91,
                 "Germany": 49,
                 "China": 86,
                 "Rwanda":250}

pd_series = pd.Series (countries_code)

pd.Series(countries_code)

df = pd.DataFrame(pd_series, columns = ['Codes'])
df

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [49]:
# mengganti index jadi kolom
df.reset_index(inplace=True)

In [50]:
df

           index  Codes
0  United States      1
1          India     91
2        Germany     49
3          China     86
4         Rwanda    250

In [52]:
df.columns

Index(['index', 'Codes'], dtype='object')

In [55]:
# mengganti nama kolom index menjadi yang kita mau
df.columns = ['Country', 'Codes']

In [58]:
# atau dengan cara formal
df.rename(columns={'Country':'Countries'}, inplace = True)

In [59]:
df

       Countries  Codes
0  United States      1
1          India     91
2        Germany     49
3          China     86
4         Rwanda    250

In [60]:
# Adding a column
# Number in population are pretty random

df ['Population'] = [100, 450, 575, 5885, 533]

df

       Countries  Codes  Population
0  United States      1         100
1          India     91         450
2        Germany     49         575
3          China     86        5885
4         Rwanda    250         533

In [65]:
# Removing a column 

df.drop('Population', axis =1, inplace = True)

# inplace untuk mengubah df asli, cara lain kalau tidak pakai inplace, synctaxnya bisa disimpan ke variabel df
# df = df.drop('Population', axis = 1)

In [63]:
df

       Countries  Codes
0  United States      1
1          India     91
2        Germany     49
3          China     86
4         Rwanda    250

In [66]:
df.columns

Index(['Countries', 'Codes'], dtype='object')

In [67]:
df.keys

<bound method NDFrame.keys of        Countries  Codes
0  United States      1
1          India     91
2        Germany     49
3          China     86
4         Rwanda    250>

In [68]:
df.index

RangeIndex(start=0, stop=5, step=1)

<a name='1-2'></a>
### B. Data Indexing, Selection and Iteration

Indexing and selection works in both Series and Dataframe.

Because DataFrame is made of Series, let's focus on how to select data in DataFrame.

In [50]:
import pandas as pd
import numpy as np

In [8]:
# Creating DataFrame from a dictionary

countries = {'Countries': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

df = pd.DataFrame(countries, index=['a', 'b', 'c', 'd'])
df

  Countries  Codes
a       USA      1
b     India     91
c    German     49
d    Rwanda    250

In [9]:
df

  Countries  Codes
a       USA      1
b     India     91
c    German     49
d    Rwanda    250

In [14]:
# cara akses series kalau nama kolom ada spasinya
df['Countries']

a       USA
b     India
c    German
d    Rwanda
Name: Countries, dtype: object

In [15]:
# kalau mau akses values doang
df['Countries'].values

array(['USA', 'India', 'German', 'Rwanda'], dtype=object)

In [16]:
# cara akses series kalau nama kolom TANPA spasi
df.Countries

a       USA
b     India
c    German
d    Rwanda
Name: Countries, dtype: object

In [17]:
df ['Codes']

a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [18]:
# cara select dataframe
# When you have many columns, columns in list will be selected

df [['Countries', 'Codes']]

  Countries  Codes
a       USA      1
b     India     91
c    German     49
d    Rwanda    250

In [19]:
# select df
df [['Countries']]

  Countries
a       USA
b     India
c    German
d    Rwanda

In [20]:
# select series
df ['Countries']

a       USA
b     India
c    German
d    Rwanda
Name: Countries, dtype: object

In [21]:
# This will return the first two rows
df [0:2]

  Countries  Codes
a       USA      1
b     India     91

In [1]:
df[0:1]

NameError: name 'df' is not defined

In [23]:
df[df.index == 'a']

  Countries  Codes
a       USA      1

You can also use `loc` to select data by the label indexes and `iloc` to select by default integer index (or by the position of the row)

In [24]:
# return nya series kalau cuma 1
df.loc['a']

Countries    USA
Codes          1
Name: a, dtype: object

In [25]:
# return data frame kalau pake slicing
df.loc['b':'d']

  Countries  Codes
b     India     91
c    German     49
d    Rwanda    250

In [26]:
df [:'b']

  Countries  Codes
a       USA      1
b     India     91

In [27]:
# indexing pakai integer dengan return series
df.iloc[2]

Countries    German
Codes            49
Name: c, dtype: object

In [28]:
# indexing pakai integer dengan slicing, return df
df.iloc[1:3]

  Countries  Codes
b     India     91
c    German     49

In [29]:
df.iloc[2:]

  Countries  Codes
c    German     49
d    Rwanda    250

In [31]:
# list indexing 1 item doang, yg direturn elemen doang
# list indexing dengan slicing, yang direturn list
# begittu juga pada data frame, kalau 1 returnnya series, kalau slicing returnnya df

df[1:3]

  Countries  Codes
b     India     91
c    German     49

### Conditional Selection

In [32]:
df

  Countries  Codes
a       USA      1
b     India     91
c    German     49
d    Rwanda    250

In [33]:
#Let's select a country with code 49

df[df['Codes'] == 49 ]

  Countries  Codes
c    German     49

In [34]:
df[df['Codes'] < 250 ]

  Countries  Codes
a       USA      1
b     India     91
c    German     49

In [35]:
df[df.Countries.str.startswith('U')]

  Countries  Codes
a       USA      1

In [37]:
df[df.Countries.str.isupper()]

  Countries  Codes
a       USA      1

In [36]:
df[df['Codes']%10 == 1]

  Countries  Codes
a       USA      1
b     India     91

In [39]:
df[df['Countries'] =='USA' ]

  Countries  Codes
a       USA      1

In [40]:
# You can use and (&) or (|) for more than conditions
#df [(condition 1) & (condition 2)]

df[(df['Codes'] == 91 ) & (df['Countries'] == 'India') ]

  Countries  Codes
b     India     91

In [42]:
df[(df['Codes'] == 91 ) | (df['Countries'] == 'India') ]

  Countries  Codes
b     India     91

In [44]:
#not (~)
df[~((df['Codes'] == 91 ) & (df['Countries'] == 'India'))]

  Countries  Codes
a       USA      1
c    German     49
d    Rwanda    250

In [41]:
df[df.Countries != 'India']

  Countries  Codes
a       USA      1
c    German     49
d    Rwanda    250

You can also use `isin()` and `where()` to select data in a series or dataframe. (is in = mengandung) (where = dimana)

In [45]:
# mirip dengan
list1 = [1,2,3]

if 1 in list1:
    print('exist')

exist

In [46]:
# isin() return false or true when provided value is included in dataframe
sample_codes_names=[1,3,250, 'USA', 'India', 'England']

df.isin(sample_codes_names)

   Countries  Codes
a       True   True
b       True  False
c      False  False
d      False   True

In [47]:
# mengambil value dari hasil isin tadi

df[df.isin(sample_codes_names)]

  Countries  Codes
a       USA    1.0
b     India    NaN
c       NaN    NaN
d       NaN  250.0

As you can see, it returned `True` wherever a country code or name was found. Otherwise, `False`. You can use a dictinary to match search by columns. A key must be a column and values are passed in list.

In [48]:
sample_codes_names = {'Codes':[1,3,250], 'Countries':['USA', 'India', 'England']}

df.isin(sample_codes_names)

   Countries  Codes
a       True   True
b       True  False
c      False  False
d      False   True

In [49]:
df[df.isin(sample_codes_names)]

  Countries  Codes
a       USA    1.0
b     India    NaN
c       NaN    NaN
d       NaN  250.0

In [55]:
# menampilkan value dlm bentuk series
df.Countries.isin(['USA', 'India', 'England'])

a     True
b     True
c    False
d    False
Name: Countries, dtype: bool

In [53]:
# menampilkan value yang true saja
df[df.Countries.isin(['USA', 'India', 'England'])]

  Countries  Codes
a       USA      1
b     India     91

In [57]:
df[df['Countries'].isin(['USA', 'India', 'England'])]

  Countries  Codes
a       USA      1
b     India     91

In [58]:
df2 = pd.DataFrame(np.array ([[1,2,3], [4,5,6], [7,8,9]]), 
                   columns = ['column 1', 'column 2', 'column 3'])

df2

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [36]:
df2.isin([0,3,4,5,7])

   column 1  column 2  column 3
0     False     False      True
1      True      True     False
2      True     False     False

In [60]:
df2[df2 > 4]

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [61]:
df2.where(df2 > 4)

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [67]:
# select biasa, di column level kalau tidak pakai where akan menampilkan value yang true saja
df2[df2['column 1']> 4]

   column 1  column 2  column 3
2         7         8         9

In [68]:
# menampilkan semua value walau true/false, yg false bernilai NaN
df2.where(df2['column 1']> 4)

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       NaN       NaN
2       7.0       8.0       9.0

`where` allows you to replace the values that doesn't meet the provided condition with any other value. So, if we do `df2.where(df2 > 4, 0)` as follows, all values less than `4` will be replaced by `0`.

In [62]:
df2.where(df2 > 4, 0)

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

Similarly, we can achieve the above by...

In [74]:
df2[df2 <= 4] = 0
df2

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

### Iteration

```
df.items() #Iterate over (column name, Series) pairs.
df.iteritems() Iterate over (column name, Series) pairs.
DataFrame.iterrows() Iterate over DataFrame rows as (index, Series) pairs.
DataFrame.itertuples([index, name]) Iterate over DataFrame rows as namedtuples.
```

In [71]:
df3 = pd.DataFrame({'Nama':['Najwa', 'Faa','Rafi','Arda','Ayu'],
                    'Kelas':['A','B','A','C','B']})

In [72]:
# Iterate over (column name, Series) pairs.

for col_name, content in df3.items():
    print(col_name)
    print(content)

Nama
0    Najwa
1      Faa
2     Rafi
3     Arda
4      Ayu
Name: Nama, dtype: object
Kelas
0    A
1    B
2    A
3    C
4    B
Name: Kelas, dtype: object

In [73]:
# Iterate over (column name, Series) pairs.
# Same as df.items()

for col_name, content in df3.iteritems():
    print(col_name)
    print(content)

Nama
0    Najwa
1      Faa
2     Rafi
3     Arda
4      Ayu
Name: Nama, dtype: object
Kelas
0    A
1    B
2    A
3    C
4    B
Name: Kelas, dtype: object

C:\Users\user\AppData\Local\Temp\ipykernel_19060\886638498.py:4: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for col_name, content in df3.iteritems():

In [77]:
# Iterate over DataFrame rows as (index, Series) pairs

for idx, row in df3.iterrows():
    print(idx)
    display(row)

0

Nama     Najwa
Kelas        A
Name: 0, dtype: object

1

Nama     Faa
Kelas      B
Name: 1, dtype: object

2

Nama     Rafi
Kelas       A
Name: 2, dtype: object

3

Nama     Arda
Kelas       C
Name: 3, dtype: object

4

Nama     Ayu
Kelas      B
Name: 4, dtype: object

In [80]:
# Iterate over DataFrame rows as namedtuples

for items in df3.itertuples():
    display(items)

Pandas(Index=0, Nama='Najwa', Kelas='A')

Pandas(Index=1, Nama='Faa', Kelas='B')

Pandas(Index=2, Nama='Rafi', Kelas='A')

Pandas(Index=3, Nama='Arda', Kelas='C')

Pandas(Index=4, Nama='Ayu', Kelas='B')

Notes: Thanks to [Prit Kalariya](https://twitter.com/pritkalariya) for Contributing the Iteration part!

<a name='1-3'></a>
### C. Dealing with Missing data

Real world datasets are messy, often with missing values. Pandas replace NaN with missing values by default. NaN stands for not a number. 

Missing values can either be ignored, droped or filled.

In [6]:
# Creating a dataframe

df3 = pd.DataFrame({'Nama':['Najwa', 'Faa','Rafi','Arda','Ayu'],
                    'Kelas':['A','B','A','C','B'],
                    'Kelompok':[1,np.nan,4,np.nan,2]})

In [84]:
df3

    Nama Kelas  Kelompok
0  Najwa     A       1.0
1    Faa     B       NaN
2   Rafi     A       4.0
3   Arda     C       NaN
4    Ayu     B       2.0

#### Checking Missing values

In [87]:
# Recognizing the missing values

df3.isnull()

# bisa juga pake 
# df3.isna()

    Nama  Kelas  Kelompok
0  False  False     False
1  False  False      True
2  False  False     False
3  False  False      True
4  False  False     False

In [88]:
# Calculating number of the missing values in each feature

df3.isnull().sum()

Nama        0
Kelas       0
Kelompok    2
dtype: int64

In [90]:
# Recognizng non missig values

df3.notna()

# bisa juga pake 
# df3.notnull()

   Nama  Kelas  Kelompok
0  True   True      True
1  True   True     False
2  True   True      True
3  True   True     False
4  True   True      True

In [91]:
df3.notna().sum()

Nama        5
Kelas       5
Kelompok    3
dtype: int64

In [95]:
# return bentuk data frame
df3[df3.Kelompok.isnull()]

   Nama Kelas  Kelompok
1   Faa     B       NaN
3  Arda     C       NaN

In [93]:
df3[-df3.Kelompok.isnull()]

    Nama Kelas  Kelompok
0  Najwa     A       1.0
2   Rafi     A       4.0
4    Ayu     B       2.0

#### Removing the missing values

In [7]:
df3

    Nama Kelas  Kelompok
0  Najwa     A       1.0
1    Faa     B       NaN
2   Rafi     A       4.0
3   Arda     C       NaN
4    Ayu     B       2.0

In [8]:
df3[df3.Kelompok.notnull()]

    Nama Kelas  Kelompok
0  Najwa     A       1.0
2   Rafi     A       4.0
4    Ayu     B       2.0

In [9]:
## Dropping missing values 

df3.dropna()

    Nama Kelas  Kelompok
0  Najwa     A       1.0
2   Rafi     A       4.0
4    Ayu     B       2.0

All rows are deleted because dropna() will remove each row which have missing value.

In [10]:
# you can drop NaNs in specific column(s)

df3['Kelompok'].dropna()

0    1.0
2    4.0
4    2.0
Name: Kelompok, dtype: float64

In [11]:
df3

    Nama Kelas  Kelompok
0  Najwa     A       1.0
1    Faa     B       NaN
2   Rafi     A       4.0
3   Arda     C       NaN
4    Ayu     B       2.0

In [12]:
# You can drop data by axis 
# Axis = 1...drop all columns with Nans
# df3.dropna(axis='columns')

# menghapus kolom yang ada nan
df3.dropna(axis=1)

    Nama Kelas
0  Najwa     A
1    Faa     B
2   Rafi     A
3   Arda     C
4    Ayu     B

In [13]:
# axis = 0...drop all rows with Nans
# df3.dropna(axis='rows') is same 

# menghapus row yang ada nan
df3.dropna(axis=0)

    Nama Kelas  Kelompok
0  Najwa     A       1.0
2   Rafi     A       4.0
4    Ayu     B       2.0

#### Filling the missing values

In [14]:
# Filling Missing values

df3.fillna(10)

    Nama Kelas  Kelompok
0  Najwa     A       1.0
1    Faa     B      10.0
2   Rafi     A       4.0
3   Arda     C      10.0
4    Ayu     B       2.0

In [15]:
df3.fillna('fillme')

    Nama Kelas Kelompok
0  Najwa     A      1.0
1    Faa     B   fillme
2   Rafi     A      4.0
3   Arda     C   fillme
4    Ayu     B      2.0

In [16]:
# You can forward fill (ffill) or backward fill(bfill)
# Or fill a current value with previous or next value

df3.fillna(method='ffill')

    Nama Kelas  Kelompok
0  Najwa     A       1.0
1    Faa     B       1.0
2   Rafi     A       4.0
3   Arda     C       4.0
4    Ayu     B       2.0

In [17]:
# Won't change it because the last values are NaNs, so it backward it

df3.fillna(method='bfill')

    Nama Kelas  Kelompok
0  Najwa     A       1.0
1    Faa     B       4.0
2   Rafi     A       4.0
3   Arda     C       2.0
4    Ayu     B       2.0

In [19]:
# If we change the axis to columns, you can see that Nans at row 2 and col 2 is backfilled with 6
df3.fillna(method='bfill', axis='columns')

df3.fillna(method='ffill', axis='columns')

    Nama Kelas Kelompok
0  Najwa     A      1.0
1    Faa     B        B
2   Rafi     A      4.0
3   Arda     C        C
4    Ayu     B      2.0

In [21]:
df3['Kelompok'] = np.where(df3['Kelompok'].isna(),df3['Nama'],df3['Kelompok'])

In [22]:
df3

    Nama Kelas Kelompok
0  Najwa     A      1.0
1    Faa     B      Faa
2   Rafi     A      4.0
3   Arda     C     Arda
4    Ayu     B      2.0

<a name='1-4'></a>
### D. More Operations and Functions

This section will show the more and most useful functions of Pandas.

In [24]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag'], 
              'Order Number':[45,56,64], 
              'Total Quantity':[10,5,9]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [25]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

#### Retrieving basic info about the Dataframe

In [26]:
# Return a summary about the dataframe

df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    3 non-null      object
 1   Order Number    3 non-null      int64
 2   Total Quantity  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [27]:
# Return dataframe columns

df4.columns

Index(['Product Name', 'Order Number', 'Total Quantity'], dtype='object')

In [28]:
# Return dataframe data

df4.keys

<bound method NDFrame.keys of   Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9>

In [29]:
# Return the head of the dataframe ....could make sense if you have long frame
# Choose how many rows you want in head()

df4.head(1)

  Product Name  Order Number  Total Quantity
0        Shirt            45              10

In [30]:
# Return the tail of the dataframe

df4.tail(1)

  Product Name  Order Number  Total Quantity
2          Bag            64               9

In [31]:
# Return NumPy array of the dataframe

df4.values

array([['Shirt', 45, 10],
       ['Boot', 56, 5],
       ['Bag', 64, 9]], dtype=object)

In [33]:
df4['Order Number'].values

array([45, 56, 64], dtype=int64)

In [37]:
df4['status'] = 'available'

In [38]:
df4

  Product Name  Order Number  Total Quantity     status
0        Shirt            45              10  available
1         Boot            56               5  available
2          Bag            64               9  available

In [39]:
# Return the size or number of elements in a dataframe

df4.size

12

In [40]:
# Return the shape

df4.shape

(3, 4)

In [41]:
# Return the length of the dataframe/the number of rows in a dataframe

df4.shape[0]

3

In [42]:
# Return the length of the dataframe/the number of columns in a dataframe

df4.shape[1]

4

#### Unique Values

In [43]:
# Return unique values in a given column 

df4['Product Name'].unique()

array(['Shirt', 'Boot', 'Bag'], dtype=object)

In [44]:
# Return a number of unique values
df4['Product Name'].nunique()

3

In [45]:
# Counting the occurence of each value in a column 

df4['Product Name'].value_counts()

Shirt    1
Boot     1
Bag      1
Name: Product Name, dtype: int64

In [46]:
df3

    Nama Kelas Kelompok
0  Najwa     A      1.0
1    Faa     B      Faa
2   Rafi     A      4.0
3   Arda     C     Arda
4    Ayu     B      2.0

In [47]:
df3.Kelas.unique()

array(['A', 'B', 'C'], dtype=object)

In [49]:
df3.Kelas.nunique()

3

In [50]:
df3.Kelas.value_counts()

A    2
B    2
C    1
Name: Kelas, dtype: int64

#### Applying a Function to Dataframe

In [51]:
# Double the quantity product

def double_quantity(x):
      return x * 2

In [52]:
df4

  Product Name  Order Number  Total Quantity     status
0        Shirt            45              10  available
1         Boot            56               5  available
2          Bag            64               9  available

In [54]:
# tapi tidak mengubah value di table
df4['Total Quantity'].apply(double_quantity)

0    20
1    10
2    18
Name: Total Quantity, dtype: int64

In [55]:
# untuk menambahkan di kolom baru
df4['Double Qty'] = df4['Total Quantity'].apply(double_quantity)

In [56]:
df4

  Product Name  Order Number  Total Quantity     status  Double Qty
0        Shirt            45              10  available          20
1         Boot            56               5  available          10
2          Bag            64               9  available          18

In [57]:
df5 = pd.DataFrame([[1,2], [4,5]], columns=['col1', 'col2'])

In [58]:
df5

   col1  col2
0     1     2
1     4     5

In [59]:
# You can also apply an anonymous function to a dataframe
# Squaring each value in dataframe

df5.applymap(lambda x: x**2)

   col1  col2
0     1     4
1    16    25

In [60]:
df5.col2.map(lambda x: x**2)

0     4
1    25
Name: col2, dtype: int64

#### Sorting values in dataframe

In [61]:
# Sort the df4 by the order number

df4.sort_values(['Order Number'])

  Product Name  Order Number  Total Quantity     status  Double Qty
0        Shirt            45              10  available          20
1         Boot            56               5  available          10
2          Bag            64               9  available          18

In [62]:
df4.sort_values(['Order Number'], ascending=False)

  Product Name  Order Number  Total Quantity     status  Double Qty
2          Bag            64               9  available          18
1         Boot            56               5  available          10
0        Shirt            45              10  available          20

In [65]:
df4

  Product Name  Order Number  Total Quantity     status  Double Qty
0        Shirt            45              10  available          20
1         Boot            56               5  available          10
2          Bag            64               9  available          18

In [64]:
df4.sort_values(['Order Number','Double Qty'], ascending=[True,False])

  Product Name  Order Number  Total Quantity     status  Double Qty
0        Shirt            45              10  available          20
1         Boot            56               5  available          10
2          Bag            64               9  available          18

<a name='1-5'></a>
### E. Aggregation Methods

In [66]:
df4

  Product Name  Order Number  Total Quantity     status  Double Qty
0        Shirt            45              10  available          20
1         Boot            56               5  available          10
2          Bag            64               9  available          18

In [67]:
# summary statistics

df4.describe()

       Order Number  Total Quantity  Double Qty
count      3.000000        3.000000    3.000000
mean      55.000000        8.000000   16.000000
std        9.539392        2.645751    5.291503
min       45.000000        5.000000   10.000000
25%       50.500000        7.000000   14.000000
50%       56.000000        9.000000   18.000000
75%       60.000000        9.500000   19.000000
max       64.000000       10.000000   20.000000

In [69]:
df4.transpose()

                        0          1          2
Product Name        Shirt       Boot        Bag
Order Number           45         56         64
Total Quantity         10          5          9
status          available  available  available
Double Qty             20         10         18

In [68]:
df4.describe().transpose()

                count  mean       std   min   25%   50%   75%   max
Order Number      3.0  55.0  9.539392  45.0  50.5  56.0  60.0  64.0
Total Quantity    3.0   8.0  2.645751   5.0   7.0   9.0   9.5  10.0
Double Qty        3.0  16.0  5.291503  10.0  14.0  18.0  19.0  20.0

In [70]:
# Mode of the dataframe
# Mode is the most recurring values

df4['Total Quantity'].mode()

0     5
1     9
2    10
Name: Total Quantity, dtype: int64

In [71]:
# The maximum value

df4['Total Quantity'].max()

10

In [72]:
# The minimum value

df4['Total Quantity'].min()

5

In [73]:
# The mean

df4['Total Quantity'].mean()

8.0

In [74]:
# The median value in a dataframe

df4['Total Quantity'].median()

9.0

In [75]:
# Standard deviation

df4['Total Quantity'].std()

2.6457513110645907

In [76]:
# Variance 

df4['Total Quantity'].var()

7.0

In [77]:
# Sum of all values in a column

df4['Total Quantity'].sum()

24

In [78]:
# Product of all values in dataframe

df4['Total Quantity'].prod()

450

<a name='1-6'></a>
### F. Groupby

`Group by` involves splitting data into groups, applying function to each group, and combining the results.

In [2]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag', 'Ankle', 'Pullover', 'Boot', 'Ankle', 'Tshirt', 'Shirt'], 
              'Order Number':[45,56,64, 34, 67, 56, 34, 89, 45], 
              'Total Quantity':[10,5,9, 11, 11, 8, 14, 23, 10]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [3]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3        Ankle            34              11
4     Pullover            67              11
5         Boot            56               8
6        Ankle            34              14
7       Tshirt            89              23
8        Shirt            45              10

In [81]:
df4.head()

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3        Ankle            34              11
4     Pullover            67              11

In [83]:
df4.tail()

  Product Name  Order Number  Total Quantity
4     Pullover            67              11
5         Boot            56               8
6        Ankle            34              14
7       Tshirt            89              23
8        Shirt            45              10

In [85]:
df4 = df4.sort_values('Product Name')

In [86]:
df4

  Product Name  Order Number  Total Quantity
3        Ankle            34              11
6        Ankle            34              14
2          Bag            64               9
1         Boot            56               5
5         Boot            56               8
4     Pullover            67              11
0        Shirt            45              10
8        Shirt            45              10
7       Tshirt            89              23

In [91]:
df4.duplicated()

3    False
6    False
2    False
1    False
5    False
4    False
0    False
8     True
7    False
dtype: bool

In [93]:
# menghapus duplicate value

df4[-df4.duplicated()]

# atau dengan cara
#df4.drop_duplicates()

  Product Name  Order Number  Total Quantity
3        Ankle            34              11
6        Ankle            34              14
2          Bag            64               9
1         Boot            56               5
5         Boot            56               8
4     Pullover            67              11
0        Shirt            45              10
7       Tshirt            89              23

In [87]:
df4.shape

(9, 3)

In [88]:
df4['Product Name'].unique()

array(['Ankle', 'Bag', 'Boot', 'Pullover', 'Shirt', 'Tshirt'],
      dtype=object)

In [89]:
df4['Product Name'].nunique()

6

In [90]:
df4['Product Name'].value_counts()

Ankle       2
Boot        2
Shirt       2
Bag         1
Pullover    1
Tshirt      1
Name: Product Name, dtype: int64

In [4]:
# Let's group the df by product name

df4.groupby('Product Name').mean()

              Order Number  Total Quantity
Product Name
Ankle                 34.0            12.5
Bag                   64.0             9.0
Boot                  56.0             6.5
Pullover              67.0            11.0
Shirt                 45.0            10.0
Tshirt                89.0            23.0

In [95]:
df4.groupby('Product Name').sum()

              Order Number  Total Quantity
Product Name
Ankle                   68              25
Bag                     64               9
Boot                   112              13
Pullover                67              11
Shirt                   90              20
Tshirt                  89              23

In [96]:
df4.groupby('Product Name').min()

              Order Number  Total Quantity
Product Name
Ankle                   34              11
Bag                     64               9
Boot                    56               5
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [97]:
df4.groupby('Product Name').max()

              Order Number  Total Quantity
Product Name
Ankle                   34              14
Bag                     64               9
Boot                    56               8
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [100]:
df4.groupby(['Product Name', 'Order Number']).max()

# tapi ini product name valuenya jd index

                           Total Quantity
Product Name Order Number
Ankle        34                        14
Bag          64                         9
Boot         56                         8
Pullover     67                        11
Shirt        45                        10
Tshirt       89                        23

In [101]:
# agar tidak jd index
df4.groupby(['Product Name', 'Order Number'],as_index=False).max()

  Product Name  Order Number  Total Quantity
0        Ankle            34              14
1          Bag            64               9
2         Boot            56               8
3     Pullover            67              11
4        Shirt            45              10
5       Tshirt            89              23

In [102]:
df4.groupby(['Product Name', 'Order Number']).sum()

                           Total Quantity
Product Name Order Number
Ankle        34                        25
Bag          64                         9
Boot         56                        13
Pullover     67                        11
Shirt        45                        20
Tshirt       89                        23

You can also use `aggregation()` after groupby.

In [5]:
df4.groupby('Product Name').aggregate(['min', 'max', 'sum'])

             Order Number          Total Quantity
                      min max  sum            min max sum
Product Name
Ankle                  34  34   68             11  14  25
Bag                    64  64   64              9   9   9
Boot                   56  56  112              5   8  13
Pullover               67  67   67             11  11  11
Shirt                  45  45   90             10  10  20
Tshirt                 89  89   89             23  23  23

In [10]:
ex1 = df4.groupby('Product Name').aggregate(['min','max','sum','mean'])

In [11]:
ex1

             Order Number                Total Quantity
                      min max  sum  mean            min max sum  mean
Product Name
Ankle                  34  34   68  34.0             11  14  25  12.5
Bag                    64  64   64  64.0              9   9   9   9.0
Boot                   56  56  112  56.0              5   8  13   6.5
Pullover               67  67   67  67.0             11  11  11  11.0
Shirt                  45  45   90  45.0             10  10  20  10.0
Tshirt                 89  89   89  89.0             23  23  23  23.0

In [12]:
ex1.columns

MultiIndex([(  'Order Number',  'min'),
            (  'Order Number',  'max'),
            (  'Order Number',  'sum'),
            (  'Order Number', 'mean'),
            ('Total Quantity',  'min'),
            ('Total Quantity',  'max'),
            ('Total Quantity',  'sum'),
            ('Total Quantity', 'mean')],
           )

In [18]:
ex1[('Order Number','min')]

             Order Number
                      min
Product Name
Ankle                  34
Bag                    64
Boot                   56
Pullover               67
Shirt                  45
Tshirt                 89

In [19]:
ex1[[('Order Number','min')]]

             Order Number
                      min
Product Name
Ankle                  34
Bag                    64
Boot                   56
Pullover               67
Shirt                  45
Tshirt                 89

In [14]:
ex1['Order Number']['min']

Product Name
Ankle       34
Bag         64
Boot        56
Pullover    67
Shirt       45
Tshirt      89
Name: min, dtype: int64

In [17]:
ex1['Order Number']['min']

Product Name
Ankle       34
Bag         64
Boot        56
Pullover    67
Shirt       45
Tshirt      89
Name: min, dtype: int64

In [9]:
df4.groupby('Product Name',as_index=False).aggregate({'Order Number':'max','Total Quantity':'sum'})

  Product Name  Order Number  Total Quantity
0        Ankle            34              25
1          Bag            64               9
2         Boot            56              13
3     Pullover            67              11
4        Shirt            45              20
5       Tshirt            89              23

# <a name='1-7'></a>
### G. Combining Datasets: Concatenating, Joining and Merging

#### Concatenation: mirip union

In [20]:
# Creating dataframes

df1 = pd.DataFrame({'Col1':['A','B','C'],
                   'Col2':[1,2,3]}, 
                   index=['a','b','c'])

df2 = pd.DataFrame({'Col1':['D','E','F'],
                   'Col2':[4,5,6]}, 
                   index=['d','e','f'])


df3 = pd.DataFrame({'Col1':['G','I','J'],
                   'Col2':[7,8,9]}, 
                   index=['g', 'i','j'])

In [21]:
df1

  Col1  Col2
a    A     1
b    B     2
c    C     3

In [22]:
df2

  Col1  Col2
d    D     4
e    E     5
f    F     6

In [23]:
df3

  Col1  Col2
g    G     7
i    I     8
j    J     9

In [24]:
# Concatenating: Adding one dataset to another

pd.concat([df1, df2, df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

The default axis is `0` (concat based on row nya). This is how the combined dataframes will look like if we change the `axis to 1`.

In [25]:
pd.concat([df1, df2, df3], axis=1)

  Col1  Col2 Col1  Col2 Col1  Col2
a    A   1.0  NaN   NaN  NaN   NaN
b    B   2.0  NaN   NaN  NaN   NaN
c    C   3.0  NaN   NaN  NaN   NaN
d  NaN   NaN    D   4.0  NaN   NaN
e  NaN   NaN    E   5.0  NaN   NaN
f  NaN   NaN    F   6.0  NaN   NaN
g  NaN   NaN  NaN   NaN    G   7.0
i  NaN   NaN  NaN   NaN    I   8.0
j  NaN   NaN  NaN   NaN    J   9.0

In [26]:
# We can also use append()

df1.append([df2, df3])

C:\Users\user\AppData\Local\Temp\ipykernel_26928\854791043.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append([df2, df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

#### Merging

If you have worked with SQL, what `pd.merge()` does may be familiar. It links data from different sources (different features) and you have a control on the structure of the combined dataset.

*Pandas Merge method(`how`): SQL Join Name : Description*



```
* left : LEFT OUTER JOIN : Use keys or columns from left frame only

* right : RIGHT OUTER JOIN : Use keys or columns from right frame only

* outer : FULL OUTER JOIN : Use union of keys or columns from both frames

* inner : INNER JOIN : Use intersection of keys or columns from both frames
```

In [27]:
df1 = pd.DataFrame({'Name': ['Joe', 'Joshua', 'Jeanne', 'David'],
                        'Role': ['Manager', 'Developer', 'Engineer', 'Scientist']})

df2 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'Year Hired': [2018, 2017, 2020, 2018]})

df3 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'No of Leaves': [15, 3, 10, 12]})

In [28]:
df1

     Name       Role
0     Joe    Manager
1  Joshua  Developer
2  Jeanne   Engineer
3   David  Scientist

In [29]:
df2

     Name  Year Hired
0   David        2018
1  Joshua        2017
2     Joe        2020
3  Jeanne        2018

In [30]:
pd.merge(df1, df2)

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2  Jeanne   Engineer        2018
3   David  Scientist        2018

In [31]:
## Let's merge on Role being a key 

pd.merge(df1, df2, how='inner', on="Name")

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2  Jeanne   Engineer        2018
3   David  Scientist        2018

In [33]:
df3.merge(df1)

     Name  No of Leaves       Role
0   David            15  Scientist
1  Joshua             3  Developer
2     Joe            10    Manager
3  Jeanne            12   Engineer

In [35]:
df3.merge(df1, how='inner', on="Name")

     Name  No of Leaves       Role
0   David            15  Scientist
1  Joshua             3  Developer
2     Joe            10    Manager
3  Jeanne            12   Engineer

In [36]:
df1 = pd.DataFrame({'col1': ['K0', 'K0', 'K1', 'K2'],
                     'col2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df2 = pd.DataFrame({'col1': ['K0', 'K1', 'K1', 'K2'],
                               'col2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [37]:
df1

  col1 col2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [38]:
df2

  col1 col2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [39]:
pd.merge(df1, df2, how='inner', on=['col1', 'col2'])

  col1 col2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [44]:
pd.merge(df1, df2, how='outer', on=['col1'])

  col1 col2_x   A   B col2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

In [40]:
pd.merge(df1, df2, how='outer', on=['col1', 'col2'])

  col1 col2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [41]:
pd.merge(df1, df2, how='left')

  col1 col2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [42]:
pd.merge(df1, df2, how='right')

  col1 col2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

#### Joining

Joining is a simple way to combine columns of two dataframes with different indexes. 

based on index, bukan kolomnya

In [45]:
df1 = pd.DataFrame({'Col1': ['A', 'B', 'C'],
                     'Col2': [11, 12, 13]},
                      index=['a', 'b', 'c']) 

df2 = pd.DataFrame({'Col3': ['D', 'E', 'F'],
                    'Col4': [14, 14, 16]},
                      index=['a', 'c', 'd'])

In [46]:
df1

  Col1  Col2
a    A    11
b    B    12
c    C    13

In [47]:
df2

  Col3  Col4
a    D    14
c    E    14
d    F    16

In [48]:
df1.join(df2)

  Col1  Col2 Col3  Col4
a    A    11    D  14.0
b    B    12  NaN   NaN
c    C    13    E  14.0

In [49]:
df2.join(df1)

  Col3  Col4 Col1  Col2
a    D    14    A  11.0
c    E    14    C  13.0
d    F    16  NaN   NaN

You can see that with `df.join()`, the alignment of data is on indexes.

In [50]:
df1.join(df2, how='inner')

  Col1  Col2 Col3  Col4
a    A    11    D    14
c    C    13    E    14

In [51]:
df1.join(df2, how='outer')

  Col1  Col2 Col3  Col4
a    A  11.0    D  14.0
b    B  12.0  NaN   NaN
c    C  13.0    E  14.0
d  NaN   NaN    F  16.0

Learn more about Merging, Joining, and Concatenating the Pandas Dataframes [here](https://pandas.pydata.org/docs/user_guide/merging.html).

<a name='1-8'></a>
### H. Beyond Dataframes: Working with CSV and Excel

In this last section of Pandas' fundamentals, we will see how to read real world data with different formats: CSV and Excel

#### CSV and Excel

Let's use california housing dataset.

In [125]:
# Let's download the data 

!curl -O https://raw.githubusercontent.com/nyandwi/public_datasets/master/housing.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 1390k  100 1390k    0     0   409k      0  0:00:03  0:00:03 --:--:--  409k

In [52]:
data = pd.read_csv('housing.csv')

In [53]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [54]:
type(data)

pandas.core.frame.DataFrame

In [56]:
## Exporting dataframe back to csv

data.to_csv('housing_dataset.csv', index=False)

In [57]:
pd.read_csv('housing_dataset.csv')

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

If you look into the folder sidebar, you can see `Housing Dataset`.

In [60]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.10-py2.py3-none-any.whl (242 kB)
     -------------------------------------- 242.1/242.1 KB 1.2 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.10
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Users\user\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [61]:
## Exporting CSV to Excel

data.to_excel('housing_excel.xlsx', index=False)

In [62]:
## Reading the Excel file back

excel_data = pd.read_excel('housing_excel.xlsx')

In [67]:
data.dtypes

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
ocean_proximity        object
dtype: object

In [65]:
data.isna().sum()

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
dtype: int64

In [63]:
data.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [64]:
data.tail(10)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20630,-121.32,39.29,11.0,2640.0,505.0,1257.0,445.0,3.5673,112000.0,INLAND
20631,-121.40,39.33,15.0,2655.0,493.0,1200.0,432.0,3.5179,107200.0,INLAND
20632,-121.45,39.26,15.0,2319.0,416.0,1047.0,385.0,3.1250,115600.0,INLAND
20633,-121.53,39.19,27.0,2080.0,412.0,1082.0,382.0,2.5495,98300.0,INLAND
20634,-121.56,39.27,28.0,2332.0,395.0,1041.0,344.0,3.7125,116800.0,INLAND
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [69]:
data.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [ ]:

excel_data.head()

<a name='2'></a>
## Real World: Exploratory Data Analysis (EDA)

All above was the basics. Let us apply some of these techniques to the real world dataset, `Red wine quality`.

In [ ]:
!curl -O https://raw.githubusercontent.com/nyandwi/public_datasets/master/winequality-red.csv

In [68]:
wine_data = pd.read_csv('winequality-red.csv')

In [70]:
# Displaying the head of the dataset

wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [71]:
# Displaying the tail of the dataset

wine_data.tail()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [72]:
# Displaying summary statistics

wine_data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
fixed acidity,1599.0,8.319637,1.741096,4.60000,7.1000,7.90000,9.200000,15.90000
volatile acidity,1599.0,0.527821,0.179060,0.12000,0.3900,0.52000,0.640000,1.58000
citric acid,1599.0,0.270976,0.194801,0.00000,0.0900,0.26000,0.420000,1.00000
residual sugar,1599.0,2.538806,1.409928,0.90000,1.9000,2.20000,2.600000,15.50000
chlorides,1599.0,0.087467,0.047065,0.01200,0.0700,0.07900,0.090000,0.61100
free sulfur dioxide,1599.0,15.874922,10.460157,1.00000,7.0000,14.00000,21.000000,72.00000
total sulfur dioxide,1599.0,46.467792,32.895324,6.00000,22.0000,38.00000,62.000000,289.00000
density,1599.0,0.996747,0.001887,0.99007,0.9956,0.99675,0.997835,1.00369
pH,1599.0,3.311113,0.154386,2.74000,3.2100,3.31000,3.400000,4.01000
sulphates,1599.0,0.658149,0.169507,0.33000,0.5500,0.62000,0.730000,2.00000
alcohol,1599.0,10.422983,1.065668,8.40000,9.5000,10.20000,11.100000,14.90000
quality,1599.0,5.636023,0.807569,3.00000,5.0000,6.00000,6.000000,8.00000

In [73]:
# Displaying quick information about the dataset 

wine_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599 entries, 0 to 1598
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fixed acidity         1599 non-null   float64
 1   volatile acidity      1599 non-null   float64
 2   citric acid           1599 non-null   float64
 3   residual sugar        1599 non-null   float64
 4   chlorides             1599 non-null   float64
 5   free sulfur dioxide   1599 non-null   float64
 6   total sulfur dioxide  1599 non-null   float64
 7   density               1599 non-null   float64
 8   pH                    1599 non-null   float64
 9   sulphates             1599 non-null   float64
 10  alcohol               1599 non-null   float64
 11  quality               1599 non-null   int64
dtypes: float64(11), int64(1)
memory usage: 150.0 KB

In [74]:
# Checking missing values

wine_data.isnull().sum()

fixed acidity           0
volatile acidity        0
citric acid             0
residual sugar          0
chlorides               0
free sulfur dioxide     0
total sulfur dioxide    0
density                 0
pH                      0
sulphates               0
alcohol                 0
quality                 0
dtype: int64

In [75]:
wine_data

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
1,7.8,0.880,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5
2,7.8,0.760,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5
3,11.2,0.280,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6
4,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [76]:
# wine quality range from 0 to 10. The higher the quality value, the good wine is

wine_data['quality'].value_counts()

5    681
6    638
7    199
4     53
8     18
3     10
Name: quality, dtype: int64

In [88]:
'''
quality class:
    - if >= 8, good
    - if >= 5, mid
    - else, bad
'''

def the_quality(x):
    if(x>=8):
        return 'good'
    elif(x>=5):
        return 'mid'
    else:
        return 'bad'

In [91]:
# cara 1
wine_data['quality_class'] = wine_data['quality'].apply(the_quality)

In [92]:
wine_data['quality_class'] = np.where(wine_data['quality']>=8,'good',
                                     np.where(wine_data['quality']>=5,'mid','bad'))

In [93]:
wine_data

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,quality_class
0,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5,mid
1,7.8,0.880,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5,mid
2,7.8,0.760,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5,mid
3,11.2,0.280,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6,mid
4,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5,mid
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5,mid
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6,mid
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6,mid
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5,mid
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6,mid

In [94]:
wine_data.quality_class.unique()

array(['mid', 'bad', 'good'], dtype=object)

In [95]:
wine_data.quality_class.value_counts()

mid     1518
bad       63
good      18
Name: quality_class, dtype: int64

In [97]:
pd.set_option('display.max_columns',50)

In [101]:
wine_data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
fixed acidity,1599.0,8.319637,1.741096,4.60000,7.1000,7.90000,9.200000,15.90000
volatile acidity,1599.0,0.527821,0.179060,0.12000,0.3900,0.52000,0.640000,1.58000
citric acid,1599.0,0.270976,0.194801,0.00000,0.0900,0.26000,0.420000,1.00000
residual sugar,1599.0,2.538806,1.409928,0.90000,1.9000,2.20000,2.600000,15.50000
chlorides,1599.0,0.087467,0.047065,0.01200,0.0700,0.07900,0.090000,0.61100
free sulfur dioxide,1599.0,15.874922,10.460157,1.00000,7.0000,14.00000,21.000000,72.00000
total sulfur dioxide,1599.0,46.467792,32.895324,6.00000,22.0000,38.00000,62.000000,289.00000
density,1599.0,0.996747,0.001887,0.99007,0.9956,0.99675,0.997835,1.00369
pH,1599.0,3.311113,0.154386,2.74000,3.2100,3.31000,3.400000,4.01000
sulphates,1599.0,0.658149,0.169507,0.33000,0.5500,0.62000,0.730000,2.00000
alcohol,1599.0,10.422983,1.065668,8.40000,9.5000,10.20000,11.100000,14.90000
quality,1599.0,5.636023,0.807569,3.00000,5.0000,6.00000,6.000000,8.00000

In [98]:
# group by
wine_data.groupby('quality_class').agg(['min','max','mean'])

              fixed acidity                 volatile acidity                  \
                        min   max      mean              min   max      mean
quality_class
bad                     4.6  12.5  7.871429             0.23  1.58  0.724206
good                    5.0  12.6  8.566667             0.26  0.85  0.423333
mid                     4.7  15.9  8.335310             0.12  1.33  0.520909

              citric acid                 residual sugar                  \
                      min   max      mean            min   max      mean
quality_class
bad                  0.00  1.00  0.173651            1.2  12.9  2.684921
good                 0.03  0.72  0.391111            1.4   6.4  2.577778
mid                  0.00  0.79  0.273590            0.9  15.5  2.532279

              chlorides                  free sulfur dioxide                   \
                    min    max      mean                 min   max       mean
quality_class
bad               0.045  0.610  0.095730                 3.0  41.0  12.063492
good              0.044  0.086  0.068444                 3.0  42.0  13.277778
mid               0.012  0.611  0.087349                 1.0  72.0  16.063900

              total sulfur dioxide                    density           \
                               min    max       mean      min      max
quality_class
bad                            7.0  119.0  34.444444  0.99340  1.00100
good                          12.0   88.0  33.444444  0.99080  0.99880
mid                            6.0  289.0  47.121212  0.99007  1.00369

                           pH                 sulphates                  \
                   mean   min   max      mean       min   max      mean
quality_class
bad            0.996689  2.74  3.90  3.384127      0.33  2.00  0.592222
good           0.995212  2.88  3.72  3.267222      0.63  1.10  0.767778
mid            0.996767  2.86  4.01  3.308603      0.37  1.98  0.659585

              alcohol                  quality
                  min   max       mean     min max      mean
quality_class
bad               8.4  13.1  10.215873       3   4  3.841270
good              9.8  14.0  12.094444       8   8  8.000000
mid               8.4  14.9  10.411759       5   7  5.682477

In [102]:
# iterasi saat group by

for quality, group in wine_data.groupby('quality_class'):
    display(quality)
    #display(group)
    display(group.describe().T)

'bad'

,count,mean,std,min,25%,50%,75%,max
fixed acidity,63.0,7.871429,1.649284,4.6000,6.800000,7.5000,8.4000,12.500
volatile acidity,63.0,0.724206,0.247970,0.2300,0.565000,0.6800,0.8825,1.580
citric acid,63.0,0.173651,0.207406,0.0000,0.020000,0.0800,0.2700,1.000
residual sugar,63.0,2.684921,1.723735,1.2000,1.900000,2.1000,2.9500,12.900
chlorides,63.0,0.095730,0.075121,0.0450,0.068500,0.0800,0.0945,0.610
free sulfur dioxide,63.0,12.063492,9.076508,3.0000,5.000000,9.0000,15.5000,41.000
total sulfur dioxide,63.0,34.444444,26.395123,7.0000,13.500000,26.0000,48.0000,119.000
density,63.0,0.996689,0.001667,0.9934,0.995655,0.9966,0.9977,1.001
pH,63.0,3.384127,0.175100,2.7400,3.300000,3.3800,3.5000,3.900
sulphates,63.0,0.592222,0.224323,0.3300,0.495000,0.5600,0.6000,2.000
alcohol,63.0,10.215873,0.918178,8.4000,9.600000,10.0000,11.0000,13.100
quality,63.0,3.841270,0.368359,3.0000,4.000000,4.0000,4.0000,4.000

'good'

,count,mean,std,min,25%,50%,75%,max
fixed acidity,18.0,8.566667,2.119656,5.0000,7.250000,8.25000,10.2250,12.6000
volatile acidity,18.0,0.423333,0.144914,0.2600,0.335000,0.37000,0.4725,0.8500
citric acid,18.0,0.391111,0.199526,0.0300,0.302500,0.42000,0.5300,0.7200
residual sugar,18.0,2.577778,1.295038,1.4000,1.800000,2.10000,2.6000,6.4000
chlorides,18.0,0.068444,0.011678,0.0440,0.062000,0.07050,0.0755,0.0860
free sulfur dioxide,18.0,13.277778,11.155613,3.0000,6.000000,7.50000,16.5000,42.0000
total sulfur dioxide,18.0,33.444444,25.433240,12.0000,16.000000,21.50000,43.0000,88.0000
density,18.0,0.995212,0.002378,0.9908,0.994175,0.99494,0.9972,0.9988
pH,18.0,3.267222,0.200640,2.8800,3.162500,3.23000,3.3500,3.7200
sulphates,18.0,0.767778,0.115379,0.6300,0.690000,0.74000,0.8200,1.1000
alcohol,18.0,12.094444,1.224011,9.8000,11.325000,12.15000,12.8750,14.0000
quality,18.0,8.000000,0.000000,8.0000,8.000000,8.00000,8.0000,8.0000

'mid'

,count,mean,std,min,25%,50%,75%,max
fixed acidity,1518.0,8.335310,1.738518,4.70000,7.1000,7.900000,9.20000,15.90000
volatile acidity,1518.0,0.520909,0.171017,0.12000,0.3900,0.520000,0.63000,1.33000
citric acid,1518.0,0.273590,0.192868,0.00000,0.1000,0.260000,0.42750,0.79000
residual sugar,1518.0,2.532279,1.397449,0.90000,1.9000,2.200000,2.60000,15.50000
chlorides,1518.0,0.087349,0.045761,0.01200,0.0700,0.079000,0.09000,0.61100
free sulfur dioxide,1518.0,16.063900,10.477423,1.00000,8.0000,14.000000,22.00000,72.00000
total sulfur dioxide,1518.0,47.121212,33.101582,6.00000,23.0000,38.000000,63.00000,289.00000
density,1518.0,0.996767,0.001883,0.99007,0.9956,0.996765,0.99786,1.00369
pH,1518.0,3.308603,0.152161,2.86000,3.2100,3.310000,3.40000,4.01000
sulphates,1518.0,0.659585,0.166541,0.37000,0.5500,0.620000,0.73000,1.98000
alcohol,1518.0,10.411759,1.053557,8.40000,9.5000,10.150000,11.10000,14.90000
quality,1518.0,5.682477,0.692246,5.00000,5.0000,6.000000,6.00000,7.00000

In [103]:
wine_data.groupby(['fixed acidity', 'volatile acidity', 'citric acid']).sum()

C:\Users\user\AppData\Local\Temp\ipykernel_26928\2841420058.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  wine_data.groupby(['fixed acidity', 'volatile acidity', 'citric acid']).sum()

                                            residual sugar  chlorides  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                    2.1      0.054
4.7           0.600            0.17                    2.3      0.058
4.9           0.420            0.00                    2.1      0.048
5.0           0.380            0.01                    1.6      0.048
              0.400            0.50                    4.3      0.046
...                                                    ...        ...
15.0          0.210            0.44                    4.4      0.150
15.5          0.645            0.49                    8.4      0.190
15.6          0.645            0.49                    4.2      0.095
              0.685            0.76                    3.7      0.100
15.9          0.360            0.65                    7.5      0.096

                                            free sulfur dioxide  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         8.0
4.7           0.600            0.17                        17.0
4.9           0.420            0.00                        16.0
5.0           0.380            0.01                        26.0
              0.400            0.50                        29.0
...                                                         ...
15.0          0.210            0.44                        20.0
15.5          0.645            0.49                        20.0
15.6          0.645            0.49                        10.0
              0.685            0.76                         6.0
15.9          0.360            0.65                        22.0

                                            total sulfur dioxide  density  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         65.0  0.99340
4.7           0.600            0.17                        106.0  0.99320
4.9           0.420            0.00                         42.0  0.99154
5.0           0.380            0.01                         60.0  0.99084
              0.400            0.50                         80.0  0.99020
...                                                          ...      ...
15.0          0.210            0.44                         48.0  2.00010
15.5          0.645            0.49                         46.0  2.00630
15.6          0.645            0.49                         23.0  1.00315
              0.685            0.76                         43.0  1.00320
15.9          0.360            0.65                         71.0  0.99760

                                              pH  sulphates  alcohol  quality
fixed acidity volatile acidity citric acid
4.6           0.520            0.15         3.90       0.56     13.1        4
4.7           0.600            0.17         3.85       0.60     12.9        6
4.9           0.420            0.00         3.71       0.74     14.0        7
5.0           0.380            0.01         3.70       0.75     14.0        6
              0.400            0.50         3.49       0.66     13.6        6
...                                          ...        ...      ...      ...
15.0          0.210            0.44         6.14       1.68     18.4       14
15.5          0.645            0.49         5.84       1.48     22.2       10
15.6          0.645            0.49         2.92       0.74     11.1        5
              0.685            0.76         2.95       0.68     11.2        7
15.9          0.360            0.65         2.98       0.84     14.9        5

[1333 rows x 9 columns]

In [104]:
wine_data.groupby(['free sulfur dioxide', 'total sulfur dioxide']).sum()

C:\Users\user\AppData\Local\Temp\ipykernel_26928\587156147.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  wine_data.groupby(['free sulfur dioxide', 'total sulfur dioxide']).sum()

                                          fixed acidity  volatile acidity  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                           18.2             0.440
                    44.0                            7.9             0.400
2.0                 45.0                            7.9             0.400
3.0                 6.0                            33.0             1.215
                    7.0                            25.8             1.520
...                                                 ...               ...
55.0                95.0                           20.4             1.080
57.0                135.0                           5.9             0.190
66.0                115.0                           6.9             0.630
68.0                124.0                          13.2             1.470
72.0                160.0                           5.9             0.290

                                          citric acid  residual sugar  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                         0.48             4.2
                    44.0                         0.29             1.8
2.0                 45.0                         0.30             1.8
3.0                 6.0                          1.38             5.0
                    7.0                          0.63             6.0
...                                               ...             ...
55.0                95.0                         0.74            30.8
57.0                135.0                        0.21             1.7
66.0                115.0                        0.33             6.7
68.0                124.0                        0.04            15.8
72.0                160.0                        0.25            13.4

                                          chlorides  density    pH  sulphates  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                      0.156  1.99800  6.82       1.74
                    44.0                      0.157  0.99730  3.30       0.92
2.0                 45.0                      0.157  0.99727  3.31       0.91
3.0                 6.0                       0.229  2.98892  9.53       1.93
                    7.0                       0.242  2.98210  9.63       1.50
...                                             ...      ...   ...        ...
55.0                95.0                      0.428  2.00738  6.36       1.54
57.0                135.0                     0.045  0.99341  3.32       0.44
66.0                115.0                     0.235  0.99787  3.22       0.56
68.0                124.0                     0.244  1.99880  6.94       1.06
72.0                160.0                     0.067  0.99721  3.33       0.54

                                          alcohol  quality
free sulfur dioxide total sulfur dioxide
1.0                 28.0                     20.6       12
                    44.0                      9.5        6
2.0                 45.0                      9.5        6
3.0                 6.0                      32.7       16
                    7.0                      35.6       18
...                                           ...      ...
55.0                95.0                     18.0       12
57.0                135.0                     9.5        5
66.0                115.0                     9.5        5
68.0                124.0                    19.8       10
72.0                160.0                    10.3        6

[870 rows x 10 columns]

This is the end of the lab that was about using Pandas to manipulate data. Alot of things will make sense when we start to prepare data for machine learning models in the next notebooks.

<a name='0'></a>

### [BACK TO TOP](#0)